package com.dementorsun.telegrambot.bot.data;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum BotMessages {

    WELCOME_MESSAGE("Вітаю, людино! Я так довго був у небутті, що радий бачити навіть тебе. Кхе-кхе! Вибач, щось в горлі пересохло. Ну що ж, якщо ти вже тут, то обирай!"),
    WELCOME_BACK_MESSAGE("%s, це знову ти!? Ні хвилини спокою..."),
    WELCOME_BACK_WITH_SILENCE_MODE_MESSAGE("%s, хто це в нас тут повернувся. Нагадаю, що перед тим як мене видалити я був переведений у режим мовчання. Щоб повернути нашу дружбу потрібно натиснути на кнопку 'Змінити час' і встановити нове значення. Вибір за тобою!"),
    FINISH_TOPICS_TUTORIAL_MESSAGE("Так собі вибір звичайно. Але хто я такий щоб тебе засуджувати. Тепер введи будь-який час у форматі '23:59'. Без кавичок звичайно..."),
    COMPLETE_TUTORIAL_MESSAGE("Нарешті! Я думав, що це ніколи не закінчиться. Відтепер в твоєму житті настануть зміни, яких ти так довго чекаєш!!! Жартую, тобі просто у обраний тобою час будуть приходити повідомлення. І не вздумай їх не читати, я тебе попередив!"),
    FAIL_TIME_FORMAT_MESSAGE("Ну ти серйозно?! Введи час у форматі '12:45'."),
    CHANGE_TOPICS_MESSAGE("Хочеш щось змінити? Ну спробуй, не буду тобі заважати."),
    TOPICS_WITH_SILENCE_MODE_MESSAGE("Навіщо це тобі? Я все одно тобі нічого не відправлю. Кнопка 'Змінити час' тобі у поміч."),
    TOPICS_ARE_CHANGED_MESSAGE("Ніби це щось змінить! Жартую, все працює як годинник."),
    TOPIC_DONE_REPEAT_CLICK("Одного разу цілком вистачить. Тримай себе в руках."),
    TOPIC_DONE_NO_CHOSEN_TOPIC_CLICK("Так не піде. Потрібно хоча б щось обрати, такі правила гри."),
    TIME_ARE_CHANGED_MESSAGE("Наче змінив. Скоро дізнаємось..."),
    TIME_CHANGING_MESSAGE("Твій час '%s'. Чекаю новий! Може в тебе навіть вийде з першого разу."),
    TIME_CHANGING_WITH_SILENCE_MODE("Що, передумав? Чекаю новий час у форматі '12:45'."),
    UNEXPECTED_ACTION_MESSAGE("Як то кажуть 'Oops, something went wrong'."),
    ACTIVATE_SILENCE_MODE_MESSAGE("Ну що ж, вибір зроблено. Відтепер, я буду мовчати. Захочеш знову отримувати від мене повідомлення тисни на кнопку 'Змінити час'. Бувай!"),
    SILENCE_MODE_IS_ALREADY_ACTIVE_MESSAGE("Я ображений і зараз в режимі тиші. Кнопка 'Змінити час'. Ти знаєш, що робити.");

    private final String message;
}